const a=`# Введение в курс
Этот курс посвящён углублённому изучению JavaScript с акцентом на сложные темы и вопросы,часто встречающиеся на собеседованиях для фронтенд-и JavaScript-разработчиков.
## Предварительные требования
### Базовые знания JavaScript:
-Типы данных-Массивы и объекты-Функции-Циклы и условные операторы-Методы и свойства объектов
## Формат курса
-Короткие лекции с практическими заданиями-Каждая лекция посвящена одной ключевой теме
## Основные темы курса
-Функции высшего порядка(this,call,apply,bind)-Замыкания-Прототипы и наследование-Объектно-ориентированное и функциональное программирование в JavaScriptКурс ориентирован на практическое применение знаний в реальных рабочих задачах.`;export{a as default};
//# sourceMappingURL=0-introduction-DcnTWVtD.js.map
